Imports and read in csv files to work with

In [41]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

df1 = pd.read_csv('./dataset1.csv')
df2 = pd.read_csv('./dataset2.csv')

Checking for any duplicate rows, but don't seem to be any.

In [42]:
# df1.drop_duplicates()
# df2.drop_duplicates()

# df1
df2

,time,month,hours_after_sunset,bat_landing_number,food_availability,rat_minutes,rat_arrival_number
0,26/12/2017 16:13,0,-0.5,20,4.000000,0.0,0
1,26/12/2017 16:43,0,0.0,28,4.000000,0.0,0
2,26/12/2017 17:13,0,0.5,25,4.000000,0.0,0
3,26/12/2017 17:43,0,1.0,71,4.000000,0.0,0
4,26/12/2017 18:13,0,1.5,44,3.753857,0.0,0
...,...,...,...,...,...,...,...
2118,1/06/2018 3:41,6,8.0,20,1.000000,0.0,0
2119,1/06/2018 4:11,6,8.5,7,1.000000,0.0,0
2120,1/06/2018 4:41,6,9.0,6,1.000000,0.0,0
2121,1/06/2018 5:11,6,9.5,7,1.000000,0.0,0
2122,1/06/2018 5:41,6,10.0,2,1.000000,0.0,0

Format datetime for they are in a consistant format that is easy to work with pandas.
create helper functions to format datetime and check heatmaps along the way.

In [43]:
def format_datetimes(df, keys):
  for key in keys:
    df[key] = pd.to_datetime(df[key], dayfirst=True, errors="coerce")

def render_corr_heatmap(df):
  corr = df.corr(numeric_only=True)

  plt.figure(figsize=(8,6))
  sns.heatmap(corr, annot=True, cmap="coolwarm", center=0)
  plt.title("Correlation Heatmap")
  plt.show()

df1_datetime_keys = ["start_time", "rat_period_start", "rat_period_end", "sunset_time"]
df2_datetime_keys = ["time"]

format_datetimes(df1, df1_datetime_keys)
format_datetimes(df2, df2_datetime_keys)

Remove bat_landing_to_food that is less than 1 second.
This column is recorded in whole seconds with the exception
of some values the are consistently 0.0xxxx, these could be
record in minutes? in which case multiplying by 60 would give
us the seconds and the rows could be left in our set.

Maybe find a correlation with another column and we can test the recorded in minutes
theory, if not we can populate it if we can find a strong enough correlation.

In [44]:
df1 = df1[df1["bat_landing_to_food"] >= 1]

df1

,start_time,bat_landing_to_food,habit,rat_period_start,rat_period_end,seconds_after_rat_arrival,risk,reward,month,sunset_time,hours_after_sunset,season
0,2017-12-30 18:37:00,16.0,rat,2017-12-30 18:35:00,2017-12-30 18:38:00,108,1,0,0,2017-12-30 16:45:00,1.870833,0
2,2017-12-30 19:51:00,4.0,fast,2017-12-30 19:50:00,2017-12-30 19:55:00,41,0,1,0,2017-12-30 16:45:00,3.107500,0
3,2017-12-30 19:52:00,10.0,rat,2017-12-30 19:50:00,2017-12-30 19:55:00,111,1,0,0,2017-12-30 16:45:00,3.126944,0
4,2017-12-30 19:54:00,15.0,rat,2017-12-30 19:50:00,2017-12-30 19:55:00,194,1,0,0,2017-12-30 16:45:00,3.150000,0
5,2017-12-30 19:54:00,24.0,rat,2017-12-30 19:50:00,2017-12-30 19:55:00,215,1,0,0,2017-12-30 16:45:00,3.155833,0
...,...,...,...,...,...,...,...,...,...,...,...,...
902,2018-05-04 04:18:00,2.0,rat,2018-05-04 04:14:00,2018-05-04 04:30:00,224,1,0,5,2018-05-03 19:22:00,8.933333,1
903,2018-05-04 04:18:00,1.0,fast,2018-05-04 04:14:00,2018-05-04 04:30:00,275,0,1,5,2018-05-03 19:22:00,8.947500,1
904,2018-05-04 04:19:00,22.0,pick,2018-05-04 04:14:00,2018-05-04 04:30:00,310,0,1,5,2018-05-03 19:22:00,8.957222,1
905,2018-05-03 23:51:00,2.0,fast,2018-05-03 23:46:00,2018-05-03 23:52:00,339,0,1,5,2018-05-03 19:22:00,4.498889,1
906,2018-05-04 05:39:00,120.0,pick_rat,2018-05-04 05:37:00,2018-05-04 06:10:00,143,1,1,5,2018-05-03 19:22:00,10.297500,1

removed rows where time rat(s) spent on platform per 30 minute block was greater than 30 minutes

In [45]:
df2 = df2[df2["rat_minutes"] <= 30]

df2

,time,month,hours_after_sunset,bat_landing_number,food_availability,rat_minutes,rat_arrival_number
0,2017-12-26 16:13:00,0,-0.5,20,4.000000,0.0,0
1,2017-12-26 16:43:00,0,0.0,28,4.000000,0.0,0
2,2017-12-26 17:13:00,0,0.5,25,4.000000,0.0,0
3,2017-12-26 17:43:00,0,1.0,71,4.000000,0.0,0
4,2017-12-26 18:13:00,0,1.5,44,3.753857,0.0,0
...,...,...,...,...,...,...,...
2118,2018-06-01 03:41:00,6,8.0,20,1.000000,0.0,0
2119,2018-06-01 04:11:00,6,8.5,7,1.000000,0.0,0
2120,2018-06-01 04:41:00,6,9.0,6,1.000000,0.0,0
2121,2018-06-01 05:11:00,6,9.5,7,1.000000,0.0,0
2122,2018-06-01 05:41:00,6,10.0,2,1.000000,0.0,0

Replace nonsense habit vavlues with empty strings

In [46]:
import re

unique_categories = df1["habit"].unique()
cleaned_categories = [category for category in unique_categories if isinstance(category, str) and re.fullmatch(r"[a-z_]+", category)]

df1["habit"] = df1["habit"].where(df1["habit"].isin(cleaned_categories), "")

Export cleaned data sets

In [47]:
df1.to_csv("clean_dataset1.csv", index=False)
df2.to_csv("clean_dataset2.csv", index=False)